test/verification/cfdemSolverPiso_nylon_ball_in_silicon_oil_tube/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
  version         2.0;
  format          ascii;
  root            "";
  case            "";
  instance        "";
  local           "";
  class           dictionary;
  object          couplingProperties;
}

/* ---------------------------- sub-models & settings ---------------------------- */

modelType B; // A or B

couplingInterval 5;

allowUseSubCFDTimeStep false;

forceModels
(
  Archimedes
  DiFeliceDrag
);

momCoupleModels
(
  implicitCouple
);

voidFractionModel divided; // divided centre

locateModel engine;

meshMotionModel noMeshMotion;

dataExchangeModel twoWayMPI;

averagingModel dense; // dense dilute

turbulenceModelType turbulenceProperties;

meshMotionModel noMeshMotion;

IOModel basicIO;

probeModel off;

clockModel off;

smoothingModel  off;

/* ---------------------------- sub-model properties ------------------------- */

implicitCoupleProps
{
  velFieldName "U";
  granVelFieldName "Us";
  voidfractionFieldName "voidfraction";
}

DiFeliceDragProps
{
  velFieldName "U";
  voidfractionFieldName "voidfraction";
  granVelFieldName "Us";
  verbose true;
}

ArchimedesProps
{
  densityFieldName "rho";
  gravityFieldName "g";
}

twoWayMPIProps
{
  liggghtsPath "../DEM/in.liggghts_run";
}

dividedProps
{
  alphaMin 0.3;
  scaleUpVol 1.0;
}

engineProps
{
  treeSearch true;
}
